Repository: zxc-demon-1337/MCubes.release
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ru

source: About us
ru: О нас

source: MCubes is an educational project created as part of the study of web development. Here I apply my knowledge of JavaScript, CSS, and working with interfaces to make something useful and interesting.
ru: MCubes — это учебный проект, созданный в рамках изучения веб-разработки. Здесь я применяю знания по JavaScript, CSS и работе с интерфейсами, чтобы сделать что-то полезное и интересное.

source: This is not a commercial product or a startup. It's just that a schoolboy from Moscow who is interested in programming and the Rubik's Cube decided to put theory and practice together. Each line of code is written independently, each bug is fixed manually, and each new feature is a step forward in mastering web technologies.
ru: Это не коммерческий продукт и не стартап. Просто школьник из Москвы, который увлекается программированием и кубиком Рубика, решил объединить теорию и практику. Каждая строка кода пишется самостоятельно, каждая ошибка исправляется вручную, а каждая новая функция - это шаг вперед в освоении веб-технологий.

source: Thank you for using my project!
ru: Спасибо вам за использование моего проекта!

source: Egor Elagin, 11th grade
ru: Егор Елагин, 11 класс

source: Login
ru: Вход в аккаунт

source: Hi again!
ru: Снова здравствуйте!

source: E-mail
ru: Эл. почта

source: Password
ru: Пароль

source: Log in
ru: Войти в аккаунт

source: Dont have an account? Register
ru: Ещё нет аккаунта? Зарегистрируйтесь

source: here
ru: здесь

source: Nickname
ru: Ник

source: Change
ru: Изменить

source: Avatar
ru: Аватар

source: Sign Out
ru: Выйти из аккаунта

source: Register
ru: Регистриация

source: Hi!
ru: Здравствуйте!

source: Password again
ru: Пароль ещё раз

source: register
ru: Регистриация

source: Already have an account? Log in
ru: Уже есть аккаунт? Войдите в него

source: Oops
ru: Упсс

source: There is nothing here yet, but we will add this section soon.
ru: Здесь пока ничего нет, но мы скоро добавим этот раздел.

source: Which cube will you choose?
ru: Какой кубик вы выберете?

source: For beginners
ru: Для новичков

source: Coming soon
ru: Скоро выйдет

source: The language of rotations
ru: Язык вращений

source: Turn the upper face clockwise
ru: Поворот верхней грани по часовой

source: Turn the upper face counterclockwise
ru: Поворот верхней грани против часовой

source: Turn the bottom face clockwise
ru: Поворот нижней грани по часовой

source: Turn the bottom face counterclockwise
ru: Поворот нижней грани против часовой

source: Turn the right side clockwise
ru: Поворот правой грани по часовой

source: Turn the right face counterclockwise
ru: Поворот правой грани против часовой

source: Turn the left side clockwise
ru: Поворот левой грани по часовой

source: Turn the left face counterclockwise
ru: Поворот левой грани против часовой

source: Turn the front face clockwise
ru: Поворот передней грани по часовой

source: Turn the front face counterclockwise
ru: Поворот передней грани против часовой

source: Turn the back face clockwise
ru: Поворот задней грани по часовой

source: Turn the back face counterclockwise
ru: Поворот задней грани против часовой

source: The whole cube rotates clockwise in the horizontal plane (F turns into L)
ru: Весь куб вращается по часовой стрелке в горизонтальной плоскости (F превращается в L).

source: The whole cube rotates counterclockwise in the horizontal plane (F turns into R)
ru: Весь куб вращается против часовой стрелки в горизонтальной плоскости (F превращается в R).

source: If there is a number 2 next to the letter, it means 2 rotations.
ru: Если рядом с буквой стоит цифра 2, это означает 2 поворота.

source: Back
ru: Назад

source: Next
ru: Далее

source: The first side
ru: Первая сторона

source: First you need to assemble the first layer on either side. For convenience, we will assemble it on a white one. We find any corner with a white color on the cube. For example, white-red-green. This corner will be the base of the first layer.
ru: Сначала нужно собрать первый слой на любой из сторон. Для удобства мы будем собирать белую сторону. Находим на кубе любой угол с белым цветом. Например, бело-красно-зеленый. Этот угол и будет основой первого слоя.

source: You need to place it at the bottom left so that the white side looks down. It turns out that the green color is looking at us.
ru: Вам нужно расположить его слева внизу так, чтобы белая сторона смотрела вниз. Получается, что зеленый цвет смотрит на нас.

source: After that, we find another corner with a white color, which has a color that looks at us at the first corner. In our case, it is a white-green-orange corner. It should be placed in front of us from the top right.
ru: После этого мы находим другой угол с белым цветом, у которого есть цвет , который смотрит на нас в первом углу. В нашем случае это бело-зелено-оранжевый угол. Он должен быть расположен перед нами в правом верхнем углу.

source: We look at where the white color is directed: towards us, to the side, or upward. Depending on this, we perform one of three algorithms
ru: Мы смотрим, куда направлен белый цвет: на нас, в сторону или вверх. В зависимости от этого мы выполняем один из трех алгоритмов

source: The white cube is facing away
ru: Белый элемент повернут от нас

source: The white element is up
ru: Белый элемент смотрит наверх

source: The white element is looking at us
ru: Белый элемент смотрит на нас

source: There may be cases when the corner is already at the bottom in its own or someone else's place and is incorrectly deployed.
ru: Могут быть случаи, когда уголок уже находится внизу на своем или чужом месте и неправильно развернут:

source: Then - (RUR'U')
ru: Далее - (RUR'U')

source: Then - 3(RUR'U')
ru: Далее - 3(RUR'U')

source: Then - 5(RUR'U')
ru: Далее - 5(RUR'U')

source: After the second corner is positioned correctly, we need to intercept the cube in our hands so that this corner is at the bottom to our left. Just like the first corner used to be.
ru: После того, как второй угол будет расположен правильно, нам нужно взять кубик в руки так, чтобы этот угол был внизу слева от нас. Так же , как это было с первым углом.

source: Next, we do the same thing: we find an element with a white color, which also has a color that looks at us at the bottom corner. This is a white-orange-blue corner. We put it on the top right in front of us, look at where the white color is directed, and make an algorithm.
ru: Далее мы делаем то же самое: находим элемент белого цвета, у которого также есть цвет, который смотрит на нас в нижнем углу. Это бело-оранжево-синий угол. Мы помещаем его сверху прямо перед собой, смотрим, куда направлен белый цвет, и выполняем алгоритм.

source: After that, we do the same with the last corner.
ru: После этого мы проделываем то же самое с последним углом.

source: The assembled first layer
ru: Собранный первый слой

source: Setting the corners of the second layer
ru: Постановка углов второго слоя

source: At this stage, you need to place the corners of the second layer correctly. So that the colors on each of the upper elements, except for yellow, match the colors of the elements below them.
ru: На этом этапе вам нужно правильно расположить углы второго слоя. Чтобы цвета на каждом из верхних элементов, за исключением желтого, совпадали с цветами элементов под ними.

source: To do this, you need to find the yellow-red-green corner and put it in the right place.: above the other corner on the first layer with red and green color. It can be deployed in different ways, the main thing is that it stands in the right place.
ru: Для этого вам нужно найти желто-красно-зеленый уголок и поместить его в нужное место: над другим уголком на первом слое красного и зеленого цветов. Его можно развернуть по-разному, главное, чтобы он стоял в нужном месте.

source: Correctly placed angle
ru: Правильно расположенный угол

source: Next, without rotating the faces of the cube, we inspect the top layer and find other corners that stand correctly. That is, the colors on them (except yellow) should be the same as the colors at the corners that stand under them.
ru: Затем, не поворачивая грани куба, мы осматриваем верхний слой и находим другие углы, которые расположены правильно. То есть цвета на них (кроме желтого) должны совпадать с цветами в углах, которые расположены под ними.

source: Two correctly positioned corners can stand side by side or diagonally.
ru: Два правильно расположенных угла могут располагаться бок о бок или по диагонали.

source: The corners stand side by side
ru: Углы стоят бок о бок

source: The corners stand diagonally
ru: Углы расположены по диагонали

source: If there are no more such corners, you need to take any other corner on the top layer and put it in the correct place. Next, we check the other corners again. We need to find a situation where at least two corners are in the right places.
ru: Если таких уголков больше нет, вам нужно взять любой другой уголок наверхнем слое и поместить его на нужное место. Затем мы снова проверяем остальные уголки. Нам нужно найти ситуацию, при которой по крайней мере два угла будут находиться в нужных местах.

source: If they are standing next to each other, you need to take the cube so that the correct corners are on the left and run the algorithm. If we run the algorithm diagonally from any position, then we get the first situation where we need to place the 2 correct corners on the left and do the algorithm again.
ru: Если они стоят бок о бок, нужно взять куб так, чтобы правильные углы были слева, и сделать алгоритм. Если же уголки стоят по диагонали, то сделаем алгоритм из любой позиции, и получим первую ситуацию где нам нужно поместить 2 правильных угла слева и повторить алгоритм.

source: Rotate the corners of the second layer
ru: Поворот углов второго слоя

source: At this stage, you need to expand the 4 corners on the top layer to assemble the entire cube. We take the cube in our hands so that the white side is on top.
ru: На этом этапе вам нужно развернуть 4 угла на верхнем слое, чтобы собрать весь кубик целиком. Берем кубик в руки так, чтобы белая сторона была сверху.

source: We will rotate the angle that is located from the bottom to our right. The moment the corner gets up correctly, the rest of the cube will collapse. Don't worry: as soon as all 4 corners are positioned correctly, the cube will reassemble.
ru: Мы повернём угол, расположенный снизу справа от нас. Как только угол встанет правильно, остальная часть куба разрушится. Не волнуйтесь! Как только все 4 угла будут расположены правильно, куб соберется заново.

source: The yellow color looks to the right side
ru: Жёлтый цвет смотрит направо

source: The yellow color is looking at us
ru: Жёлтый цвет смотрит на нас

source: The corner is positioned correctly
ru: Угол стоит правильно

source: Next, you need to move the bottom edge to put the next corner with yellow color from the bottom right. We do formules again until the corner gets up correctly. We do this until all 4 corners are positioned correctly and the cube is fully assembled.
ru: Далее вам нужно сдвинуть нижний край, чтобы поставить следующий уголок с желтым цветом справа внизу. Повторяем формулы, пока уголок не встанет правильно. Мы делаем это до тех пор, пока все 4 угла не будут расположены правильно и куб не будет полностью собран.

source: At this stage, a situation may arise that causes many to abandon the build. It may happen that all four corners unfolded correctly, but the first 2 layers collapsed. It is important not to move the cube in your hands and keep it in the same position.
ru: На этом этапе может возникнуть ситуация, которая заставит многих отказаться от сборки. Может случиться так, что все четыре угла сложились правильно, но первые 2 слоя разрушились. Важно не двигать кубик в руках и держать его в одном и том же положении.

source: We need to keep doing formules. After a certain number of bangs, the first two layers will come together, but there will be one unrolled corner. This is an impossible situation, and it only means that this corner unfolded mechanically on the cube. That is, you just need to take it with your fingers and physically turn it so that it stands up correctly.
ru: Нам нужно продолжать выполнять формулы. После определенного количества повторений первые два слоя сойдутся, но останется один неповёрнутый правильно уголок. Это невозможная ситуация, и это означает только то, что этот уголок повернулся механически на кубе. То есть вам нужно просто взять его пальцами и физически повернуть, чтобы он встал правильно

source: You did it!!
ru: Ты сделал это!!

source: Congratulations on your first victory over the Rubik's Cube 2x2!
ru: Поздравляем вас с первой победой над кубиком рубика 2x2!

source: You've just proved that even the most complicated tasks are amenable to logic, patience, and perseverance. This is your first step into the wonderful world of puzzles, high—speed collecting and spatial thinking.
ru: Вы только что доказали, что даже самые сложные задания поддаются логике, терпению и настойчивости. Это ваш первый шаг в удивительный мир головоломок, скоростного собирания и пространственного мышления.

source: Let this little cube be the beginning of something big: new records, interesting discoveries, and maybe even hobbies for years to come. Keep your grip — there's still 3x3, 4x4 ahead... and who knows, maybe one day you'll assemble the 5x5 blindly!
ru: Пусть этот маленький кубик станет началом чего-то большого: новых рекордов, интересных открытий и, возможно, даже увлечений на долгие годы. Не сдавайтесь — впереди еще 3х3, 4х4... и кто знает, может быть, однажды вы соберете 5х5 вслепую!

source: Well done!
ru: Отличная работа!

source: Home
ru: Главная

source: Introduction
ru: Введение

source: The formula is a set of rotations of a Rubik's cube: RUR'U' = turn the right face clockwise, turn the upper face clockwise, turn the right face counterclockwise, turn the upper face counterclockwise. More detailed -
ru: Формула - это набор вращений кубика рубика: RUR'U' = поворот правой грани по часовой стрелке, поворот верхней грани по часовой стрелке, поворот правой грани против часовой стрелки, поворот верхней грани против часовой стрелке. Подробнее -

source: language of rotations
ru: язык вращений

source: right "bang-bang"
ru: правый "пиф-паф"

source: left "bang-bang"
ru: левый "пиф-паф"

source: You may also encounter a type 3 entry (RUR'U'), which means that the formula in parentheses (in this case RUR'U') must be repeated 3 times.
ru: Также вам может встретиться запись по типу 3(RUR'U'), это означает, что формулу в скобках (в данном случае RUR'U'), нужно повторить 3 раза.

source: If you see a photo of a cube with a red border, it means that by clicking on the cube, you can view a video animation of the formula signed under it.
ru: Если вы увидите фото кубика с красной окантовкой, это означает, что вы, по нажатию на кубик, можете просмотреть видео-анимацию формулы, подписанной под ним.

source: What can you find here?
ru: Что вы можете здесь найти?

source: Education
ru: Обучение

source: Here you can learn how to assemble a Rubik's cube from scratch.
ru: Здесь вы можете обучиться сборке кубика Рубика с нуля.

source: Library
ru: Библиотека

source: Here you will find a collection of all formulas.
ru: Здесь вы найдете коллекцию всех формул.

source: Timer
ru: Таймер

source: Here you can measure the speed of your assembling.
ru: Здесь вы можете измерить скорость вашей сборки.

source: Stats
ru: Статистика

source: Here you can track your stats.
ru: Здесь вы можете отслеживать свою статистику.

source: Choose what you need and go ahead to conquer the heights!
ru: Выбирайте то, что вам нужно, и вперед покорять вершины!

source: Which cube do you need a timer for?
ru: Для какого кубика вам нужен таймер?

source: Important!
ru: Важно!

source: To use the timer, press the SPACE BAR and the inspection time will start. After the end of the inspection time, press the SPACE BAR to start the timer itself. When you finish collecting the cube, press the SPACE bar to find out your time.
ru: Для использования таймера, нажмите ПРОБЕЛ, и начнётся время для инспекции. После окончания времени на инспекцию нажмите ПРОБЕЛ, чтобы запустить сам таймер. Как закончите собирать кубик нажмите ПРОБЕЛ, чтобы узнать своё время

source: In order for the cube to be displayed correctly, hold the cube like this before disassembling: the white side is below, the green side is looking at you.
ru: Чтобы развёртка куба правильно отображалась, перед разборкой держите куб так: белая сторона снизу, зелёная сторона смотрит на вас.

source: OK
ru: Понятно

source: 2x2 timer
ru: Таймер для 2x2

source: Scramble
ru: Скрамбл

source: AVG of 5
ru: СРЕД. из 5

source: Total solves:
ru: Всего сборок:

source: Cube type
ru: Тип кубика

source: Formula
ru: Формула

source: Solve time
ru: Время сборки

source: Solve date
ru: Дата сборки

source: The cube is assembled!
ru: Кубик собран!
